# nicholas Early
## Week 13
## Python data grouping and mapping

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [2]:
df = DataFrame({'City':['Alma','Brian Head','Fox Park','Lake Mary',],
               'Altitude':[10355,9800,9062,8966]})
df

         City  Altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [4]:
st_map = {'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming','Lake Mary':'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [8]:
df['State'] = df['City'].map(st_map)
df

         City  Altitude       state       State
0        Alma     10355    Colorado    Colorado
1  Brian Head      9800        Utah        Utah
2    Fox Park      9062     Wyoming     Wyoming
3   Lake Mary      8966  California  California

In [14]:
df.drop(['state'],axis=1)

         City  Altitude       State
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [18]:
#apply
def meter(x):
    return x / 3.2808

In [19]:
df['Altitude'] = df['Altitude'].apply(meter)
df

         City     Altitude       state       State
0        Alma  3156.242380    Colorado    Colorado
1  Brian Head  2987.076323        Utah        Utah
2    Fox Park  2762.131188     Wyoming     Wyoming
3   Lake Mary  2732.870032  California  California

In [20]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'), index=['UT','OH','TX','OR'])

df

           b         d         e
UT -1.140206 -0.212075 -1.027235
OH  0.300611  0.306448 -2.018396
TX -0.285553  2.327226 -2.264719
OR -1.349450 -0.414303  0.237331

In [21]:
def dif(x):
    return x.max()-x.min()

In [24]:
df.apply(dif)

b    1.650060
d    2.741529
e    2.502050
dtype: float64

In [26]:
df.apply(dif,axis=1)

UT    0.928131
OH    2.324844
TX    4.591945
OR    1.586780
dtype: float64

In [27]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-2.264719  0.0  0.0  1.0
-2.018396  0.0  0.0  1.0
-1.349450  1.0  0.0  0.0
-1.140206  1.0  0.0  0.0
-1.027235  0.0  0.0  1.0
-0.414303  0.0  1.0  0.0
-0.285553  1.0  0.0  0.0
-0.212075  0.0  1.0  0.0
 0.237331  0.0  0.0  1.0
 0.300611  1.0  0.0  0.0
 0.306448  0.0  1.0  0.0
 2.327226  0.0  1.0  0.0

In [30]:
#groupby
df= DataFrame({'k1': ['a','a','b','b','c'],
              'k2':['one','two','one','two','one'],
              'dataset1': np.random.randn(5),
             'dataset2': np.random.randn(5)})
df

  k1   k2  dataset1  dataset2
0  a  one  1.340226 -2.332546
1  a  two  0.685692  2.368647
2  b  one -0.246286  2.211567
3  b  two  0.347857 -0.682579
4  c  one  0.362129  0.285092

In [32]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [33]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [36]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [37]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a   1.012959  0.018051
b   0.050785  0.764494
c   0.362129  0.285092

In [38]:
df['dataset1'].groupby(df['k1']).mean()

k1
a    1.012959
b    0.050785
c    0.362129
Name: dataset1, dtype: float64